# 账号配置区域
# 校园网账号和密码
ACCOUNT = ''
PASSWORD = ''

# 超级鹰第三方验证码识别平台账号密码和密钥
verify_code_ACCOUNT = ''
verify_code_PASSWORD = ''
soft_id = ''

# 选取推送方式 (0:邮箱;1:bark;2:all)
send_method = 0

# 邮箱配置区域
my_sender = ''  # 填写发信人的邮箱账号
my_pass = ''  # 发件人邮箱授权码
my_user = ''  # 收件人邮箱账号

# bark配置区域
bark_api = ''

# 其他需要搜索的课程名称(如：网络课堂)
className = ''

# 隔多少时间推送一次,单位是秒
Push_cycle = 1800

# 校公选课类别,如有需要,按以下表格填写
Class_Subject = 0
'''
0. 不选择
1. 文化素质通识课 - 哲学与历史
2. 文化素质通识课 - 文学与艺术
3. 文化素质通识课 - 健康与社会
4. 文化素质通识课 - 经济与管理
5. 文化素质通识课 - 科学与技术
6. 文化素质通识课 - 创新与创业
7. 文化素质通识课 - 科技实践
8. 实践训练通识课 - 艺术实践
9. 实践训练通识课 - 科技实践
10. 实践训练通识课 - 文化实践
11. 专项英语
12. 通识教育选修课
13. 实验选修课
14. 文化素质通识课（小学期）-哲学与历史（小学期）
15. 文化素质通识课（小学期）-文学与艺术（小学期
16. 文化素质通识课（小学期）-健康与社会（小学期）
'''
